Revit 2026 API

# FamilyManagerParameter(BuiltInParameter) Property

---

Obtains the parameter of this type with a given parameter id.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FamilyParameter this[
	BuiltInParameter parameterId
] { get; }
```
```vb
Public ReadOnly Property Parameter (
	parameterId As BuiltInParameter
) As FamilyParameter
	Get
```
```cpp
public:
property FamilyParameter^ Parameter[BuiltInParameter parameterId] {
	FamilyParameter^ get (BuiltInParameter parameterId);
}
```
```fsharp
member Parameter : FamilyParameter with get
```

#### Parameters

parameterId BuiltInParameter

#### Property Value

FamilyParameter

Returns  if the parameter is not found.

#### Reference

FamilyManager Class

Parameter Overload

Autodesk.Revit.DB Namespace